using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SpbBanka2_Reports
{
    class Points
    {
        // название точек
        public static string[] 
            pointsNames = { "ПП ЭД", "ПП ПВ", "П ВВРУ", "НП ВУ", "П РПШ", "ПП ВОБ", "КП 0°", "КП 90°", "КП 180°", "КП 270°" },
            stripsNames = { "VA_10_5000", "VV_10_1000" };



        // индексы входных каналов (из архива RAPID SCADA) 
        // !! при добавлении в конфигурацию каналов приведенные ниже номера могут измениться!!


        // ЗНАЧЕНИЯ ВИБРОПАРАМЕТРОВ
        // VA = Vibration Acceleration = Виброускорение;  VV = Vibration Velocity = Виброскорость;  Strip = Полоса

        public static int[]            
            Parameters_VA_Strip_10_5000 = { 50005, 50105, 50205, 50305, 50405, 50505, 50605, 50705, 50805, 50905 },    // Виброускорение в полосе 10-5000 Гц

            Parameters_VV_Strip_10_1000 = { 50001, 50101, 50201, 50301, 50401, 50501, 50601, 50701, 50801, 50901 };    // Виброскорость в полосе 10-1000 Гц




        // УСТАВКИ
        // Lim = Limit = Уставка;  Crash = Авария;  Danger = Опасность;  Warning = Предупреждение;  Norm = Норма;  VA = Vibration Acceleration = Виброускорение;  VV = Vibration Velocity = Виброскорость;  Strip = Полоса

        public static int[]   // 10-5000 Гц     
            Lim_VA_Strip_10_5000_Crash      = { 1238, 1252, 1266, 1280, 1294, 1308, 1322, 1336, 1350, 1364 },   // Авария
            Lim_VA_Strip_10_5000_Danger     = { 1239, 1253, 1267, 1281, 1295, 1309, 1323, 1337, 1351, 1365 },   // Опасность
            Lim_VA_Strip_10_5000_Warning    = { 1240, 1254, 1268, 1282, 1296, 1310, 1324, 1338, 1352, 1366 },   // Предупреждение
            Lim_VA_Strip_10_5000_Norm       = { 1241, 1255, 1269, 1283, 1297, 1311, 1325, 1339, 1353, 1367 };   // Норма
                

        public static int[]   //  10-1000 Гц    ППЭД 
            Lim_VV_Strip_10_1000_Crash      = { 1231, 1245, 1259, 1273, 1287, 1301, 1315, 1329, 1343, 1357 },   // Авария
            Lim_VV_Strip_10_1000_Danger     = { 1232, 1246, 1260, 1274, 1288, 1302, 1316, 1330, 1344, 1358 },   // Опасность
            Lim_VV_Strip_10_1000_Warning    = { 1233, 1247, 1261, 1275, 1289, 1303, 1317, 1331, 1345, 1359 },   // Предупреждение
            Lim_VV_Strip_10_1000_Norm       = { 1234, 1248, 1262, 1276, 1290, 1304, 1318, 1332, 1346, 1360 };   // Норма
    }
}
